driver-tests/bpelse/samples/samplesJBI/test/results/echo_echo1/Actual_20130325142726_S.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <helloObj xmlns="urn:FooBar" xmlns:msgns="urn:FooBar">
      <string>TestString</string>
      <nonNegativeInteger>200</nonNegativeInteger>
      <byte>2</byte>
      <short>1</short>
      <int>3</int>
      <long>10</long>
      <negativeInteger>-201</negativeInteger>
      <dateTime>2008-09-28T18:49:45</dateTime>
      <nonPositiveInteger>-200</nonPositiveInteger>
      <duration>P1Y2M6DT14H25M13S</duration>
      <ENTITIES>string</ENTITIES>
      <double>1.051732E7</double>
      <ENTITY>string</ENTITY>
      <float>1.5E2</float>
    </helloObj>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>